[
    {
        "id": "ab3c9e1a-347e-4459-85ea-2e99b6e340d4",
        "name": "Alex Johnson",
        "gender": "male",
        "age": 45,
        "location": "Milan",
        "insights": [
            "You arrive at a large square where a crowd gathers. Music echoes from the side streets. What do you do? Climb a tower to get a better view.",
            "A host offers you a companion to explore with. Who do you pick? A grounded local with strong opinions.",
            "Someone invites you to an underground event. It’s unstructured, strange, and secret. How do you respond? Politely decline and ask what it’s about first.",
            "You're asked to join a spontaneous performance. What do you do? Join, but only as an observer/supporter.",
            "You’re placed in a room with strangers for 5 minutes. What do you do? Ask a thought-provoking question.",
            "You’re asked to draw a memory that defines you. What do you draw? Draw a place.",
            "You can join one of three groups in the city. Which do you choose? The Builders – thinkers, planners, debaters.",
            "When you connect with someone, what do you most want to feel? Understood."
        ],
        "narrative": ""
    },
    {
        "id": "135e7f70-1b25-4b41-a4d6-18d4909437d4",
        "name": "Ben Davis",
        "gender": "male",
        "age": 19,
        "location": "Milan",
        "insights": [
            "You arrive at a large square where a crowd gathers. Music echoes from the side streets. What do you do? Follow the music.",
            "A host offers you a companion to explore with. Who do you pick? A hyper-curious guide asking endless questions.",
            "Someone invites you to an underground event. How do you respond? Accept immediately.",
            "You're asked to join a spontaneous performance. What do you do? Dive in without thinking.",
            "You’re placed in a room with strangers. What do you do? Start talking and break the ice.",
            "You’re asked to draw a memory that defines you. What do you draw? Draw a symbol or abstract shape.",
            "You can join one of three groups. Which do you choose? The Dreamers – idealists, artists, rebels.",
            "When you connect with someone, what do you most want to feel? Inspired."
        ],
        "narrative": ""
    },
    {
        "id": "c1bc0e7a-47da-49b5-80cf-9b8379d9f27a",
        "name": "Chloe Miller",
        "gender": "female",
        "age": 62,
        "location": "Milan",
        "insights": [
            "You arrive at a large square where a crowd gathers. What do you do? Approach a group chatting calmly.",
            "A host offers you a companion to explore with. Who do you pick? A silent artist sketching in the corner.",
            "Someone invites you to an underground event. How do you respond? Avoid it — doesn’t feel safe.",
            "You're asked to join a spontaneous performance. What do you do? Avoid it, not your thing.",
            "You’re placed in a room with strangers. What do you do? Wait for someone to speak to you.",
            "You’re asked to draw a memory. What do you draw? Draw a symbol or abstract shape.",
            "You can join one of three groups. Which do you choose? The Dreamers – idealists, artists, rebels.",
            "When you connect with someone, what do you most want to feel? At peace."
        ],
        "narrative": ""
    },
    {
        "id": "b214734f-9d23-481b-b8c2-3971a0ae9b9f",
        "name": "Daniel White",
        "gender": "non_binary",
        "age": 34,
        "location": "Milan",
        "insights": [
            "You arrive at a large square. What do you do? Follow the music.",
            "A host offers you a companion. Who do you pick? A hyper-curious guide asking endless questions.",
            "Someone invites you to an underground event. How do you respond? Accept immediately.",
            "You're asked to join a performance. What do you do? Dive in without thinking.",
            "You’re placed in a room with strangers. What do you do? Start talking and break the ice.",
            "You’re asked to draw a memory. What do you draw? Draw a person.",
            "You can join one of three groups. Which do you choose? The Connectors – social hearts, activists.",
            "When you connect with someone, what do you most want to feel? Inspired."
        ],
        "narrative": ""
    },
    {
        "id": "14bb77e2-0980-4a3e-9b9d-90a32905e5d1",
        "name": "Emily Brown",
        "gender": "non_binary",
        "age": 56,
        "location": "Milan",
        "insights": [
            "You arrive in a large square. What do you do? Climb a tower to get a better view.",
            "You choose a companion. Who? A silent artist sketching in the corner.",
            "You're invited to an underground event. Your response? Politely decline and ask what it’s about first.",
            "Spontaneous performance — your choice? Join, but only as an observer/supporter.",
            "In a room of strangers, you… Ask a thought-provoking question.",
            "You draw a memory. It is… A place.",
            "Your chosen group? The Builders – thinkers, planners, debaters.",
            "In connection, you want to feel… Understood."
        ],
        "narrative": ""
    },
    {
        "id": "eb42cc4e-0a6a-4a5b-8c37-4cfad6f2f08f",
        "name": "Frank Green",
        "gender": "male",
        "age": 45,
        "location": "Milan",
        "insights": [
            "You arrive at a large square where a crowd gathers. What do you do? Approach a group chatting calmly.",
            "A host offers you a companion to explore with. Who do you pick? A grounded local with strong opinions.",
            "Someone invites you to an underground event. How do you respond? Avoid it — doesn’t feel safe.",
            "You're asked to join a spontaneous performance. What do you do? Avoid it, not your thing.",
            "You’re placed in a room with strangers. What do you do? Wait for someone to speak to you.",
            "You’re asked to draw a memory. What do you draw? Draw a person.",
            "You can join one of three groups. Which do you choose? The Connectors – social hearts, activists.",
            "When you connect with someone, what do you most want to feel? At peace."
        ],
        "narrative": ""
    },
    {
        "id": "f89115f7-b946-4c1e-a26c-d772b1383e54",
        "name": "Grace Taylor",
        "gender": "female",
        "age": 31,
        "location": "Milan",
        "insights": [
            "You arrive at a large square. What do you do? Follow the music.",
            "Your companion? A silent artist sketching in the corner.",
            "You’re invited to a strange event. You… Accept immediately.",
            "Spontaneous performance? You… Dive in without thinking.",
            "Room of strangers — you… Start talking and break the ice.",
            "You draw… A symbol or abstract shape.",
            "You join… The Dreamers – idealists, artists, rebels.",
            "What do you seek in connection? Inspired."
        ],
        "narrative": ""
    },
    {
        "id": "1c4961b6-15b0-4cf0-97ce-312c8b1efb69",
        "name": "Henry Wilson",
        "gender": "male",
        "age": 22,
        "location": "Milan",
        "insights": [
            "You arrive. What do you do? Climb a tower to get a better view.",
            "Your companion? A hyper-curious guide asking endless questions.",
            "You’re invited to an event. You… Politely decline and ask what it’s about first.",
            "Spontaneous performance? You… Join, but only as an observer/supporter.",
            "Room of strangers — you… Ask a thought-provoking question.",
            "You draw… A place.",
            "You join… The Builders – thinkers, planners, debaters.",
            "Connection brings… Understanding."
        ],
        "narrative": ""
    },
    {
        "id": "346b4037-dba2-4cb3-9176-bc445efecb3e",
        "name": "Ivy Moore",
        "gender": "female",
        "age": 34,
        "location": "Milan",
        "insights": [
            "You arrive in the square. What do you do? Approach a group chatting calmly.",
            "You choose a companion. Who? A silent artist sketching in the corner.",
            "Underground event invite? You… Avoid it — doesn’t feel safe.",
            "Spontaneous performance? You… Avoid it, not your thing.",
            "In a room of strangers… Wait for someone to speak to you.",
            "You draw… A person.",
            "You join… The Connectors – social hearts, activists.",
            "Connection feels best when… At peace."
        ],
        "narrative": ""
    },
    {
        "id": "38a68910-2e0d-4f09-8fc9-25ff0f4a183b",
        "name": "Jade Thomas",
        "gender": "female",
        "age": 28,
        "location": "Milan",
        "insights": [
            "You arrive — what do you do? Follow the music.",
            "Your companion? A hyper-curious guide asking endless questions.",
            "Event invitation? Accept immediately.",
            "Performance? Dive in without thinking.",
            "Strangers? Start talking and break the ice.",
            "Draw? A symbol or abstract shape.",
            "Join? The Dreamers – idealists, artists, rebels.",
            "Connect to feel… Inspired."
        ],
        "narrative": ""
    }
]